**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [34]:
import numpy as np
import pandas as pd

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data)
df

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
4  spoonbills  6.0       3       no
5      Cranes  3.0       4       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [3]:
df.index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df.iloc[:,0]

a        Cranes
b        Cranes
c       plovers
d    spoonbills
e    spoonbills
f        Cranes
g       plovers
h        Cranes
i    spoonbills
j    spoonbills
Name: birds, dtype: object

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [12]:
df.describe()

         birds
count       10
unique       3
top     Cranes
freq         4

**3. Print the first 2 rows of the birds dataframe **

In [12]:
df.iloc[0:2, 0]

a    Cranes
b    Cranes
Name: birds, dtype: object

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [10]:
df.iloc[:,0:2]

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [17]:
df.index = [0,1,2,3,4,5,6,7,8,9]
df.loc[[2,3,7],['birds','age','visits']]

        birds  age  visits
2     plovers  1.5       3
3  spoonbills  NaN       4
7      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [35]:
df.index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df.loc[df['visits']<4,['visits']]

   visits
a       2
c       3
e       3
g       2
h       2
i       3
j       2

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [20]:
df.loc[df['age'].isnull(), ['birds', 'visits']]

        birds  visits
d  spoonbills       4
h      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [21]:
df[(df['birds'] == 'Cranes')&(df['age']<4)]

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [22]:
df[df['age'].between(2,4)]

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [62]:
df[df['birds'] == 'Cranes'].sum()['visits']

12

**11. Calculate the mean age for each different birds in dataframe.**

In [68]:
df.groupby('birds').mean()['age']

birds
Cranes        3.5
plovers       3.5
spoonbills    6.0
Name: age, dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [36]:
k = {'birds':'kingfisher', 'age':np.nan, 'visits':4, 'priority': 'yes'}

df = df.append(k,ignore_index = True)
df.index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k']
df

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no
k  kingfisher  NaN       4      yes

In [37]:
df.drop('k')

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [121]:
df.groupby(['birds']).size()

birds
Cranes        4
plovers       2
spoonbills    4
dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [38]:
df.sort_values('age', ascending = False)['birds']

i    spoonbills
e    spoonbills
g       plovers
b        Cranes
j    spoonbills
a        Cranes
f        Cranes
c       plovers
d    spoonbills
h        Cranes
k    kingfisher
Name: birds, dtype: object

In [39]:
df.sort_values('visits', ascending = True)['birds']

a        Cranes
g       plovers
h        Cranes
j    spoonbills
c       plovers
e    spoonbills
i    spoonbills
b        Cranes
d    spoonbills
f        Cranes
k    kingfisher
Name: birds, dtype: object

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [40]:
df.priority.replace(['yes', 'no'], [1, 0])

a    1
b    1
c    0
d    1
e    0
f    0
g    0
h    1
i    0
j    0
k    1
Name: priority, dtype: int64

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [41]:
df.birds.replace('Cranes', 'trumpeters')

a    trumpeters
b    trumpeters
c       plovers
d    spoonbills
e    spoonbills
f    trumpeters
g       plovers
h    trumpeters
i    spoonbills
j    spoonbills
k    kingfisher
Name: birds, dtype: object